{
  "about": {
    "title": "About Us",
    "storyTitle": "Our Story",
    "storyDescription": "Towa Denki was founded on the principles of integrity, hard work, and a passion for solving complex electrical challenges. From our humble beginnings as a small local business, we have grown into a well-known electrical maintenance company renowned for our exceptional craftsmanship and customer service.",
    "storyImageAlt": "Company history image",
    
    "teamTitle": "Our Team",
    "teamDescription": "At Towa Denki, we believe that our team is the heart of our success. We are proud to have a dedicated team of skilled professionals who work tirelessly to deliver the best services to our clients.",
    "teamImageAlt": "Team working together",
    
    "valuesTitle": "Our Values",
    "valuesImageAlt": "Core values image",
    "values": {
      "quality": {
        "title": "Quality",
        "description": "We are committed to providing top-tier services and using only the highest quality materials for all our projects."
      },
      "safety": {
        "title": "Safety",
        "description": "Safety is our number one priority. We ensure all our projects meet the strictest safety standards."
      },
      "integrity": {
        "title": "Integrity",
        "description": "We conduct our business with the highest ethical standards, ensuring transparency and honesty in everything we do."
      },
      "customerSatisfaction": {
        "title": "Customer Satisfaction",
        "description": "Our clients are at the heart of our business. We strive to exceed their expectations on every project."
      }
    },

    "missionTitle": "Our Mission",
    "missionDescription": "Our mission is to provide reliable, innovative electrical solutions that enhance the daily lives of our clients while ensuring the utmost safety and efficiency.",
    "missionImageAlt": "Mission statement image",
    
    "visionTitle": "Our Vision",
    "visionDescription": "Our vision is to be the leading electrical maintenance company, recognized globally for our commitment to quality, safety, and customer satisfaction.",
    "visionImageAlt": "Vision statement image",

    "companyProfile": {
      "title": "Company Profile",
      "description": "Towa Denki is a renowned electrical maintenance company, offering high-quality services to clients across various industries. Our solutions are tailored to meet the specific needs of each client, ensuring reliability and efficiency in every project we undertake.",
      "imageAlt": "Company profile image"
    },
    
    "founderProfile": {
      "title": "Founder Profile",
      "description": "Our founder, Mr. Takashi Yamamoto, began Towa Denki with a clear vision: to deliver superior electrical services with integrity and dedication. His passion for innovation and quality has been the driving force behind our growth.",
      "imageAlt": "Founder of the company"
    },
    
    "ceoProfile": {
      "title": "CEO Profile",
      "description": "Our CEO, Ms. Yuki Sato, brings over 20 years of experience in the electrical industry. Her leadership has been instrumental in positioning Towa Denki as a leader in the industry, driving the company’s expansion and innovation.",
      "imageAlt": "CEO of the company"
    }
  }
}
